{
    "john adams":"John Adams, Jr. (October 30,1735   July 4, 1826)  was the second President of the United States (1797 1801). He also served as America's first Vice President (1789 1797). He was defeated for re-election in the 'Revolution of 1800' by Thomas Jefferson. Adams was also the first President to reside in the newly built White House in Washington, D.C., which was completed in 1800.Adams, a sponsor of the American Revolution in Massachusetts, was a driving force for independence in 1776; Jefferson called him the 'Colossus of Independence'. He represented the Continental Congress in Europe. He was a major negotiator of the eventual peace treaty with Great Britain, and chiefly responsible for obtaining the loans from the Amsterdam money market necessary for the conduct of the Revolution. His prestige secured his two elections as Washington's Vice President and his election to succeed him.   As President, he was frustrated by battles inside his own Federalist party against a faction led by Alexander Hamilton, but he broke with them to avert a major conflict with France in 1798, during the Quasi-War crisis. He became the founder of an important family of politicians, diplomats and historians, and in recent years his reputation has improved.",
    "aames monroe":"James Monroe (April 28, 1758 – July 4, 1831) was the fifth President of the United States (1817-1825). His administration was marked by the acquisition of Florida (1819); the Missouri Compromise (1820), in which Missouri was declared a slave state; and the profession of the Monroe Doctrine (1823), declaring U.S. opposition to European interference in the Americas.The President’s parents, father Spence Monroe (ca. 1727 1774), a woodworker and tobacco farmer, and mother Elizabeth Jones Monroe had significant land holdings but little money. Like his parents, he was a slaveholder. Born in Westmoreland County, Virginia, Monroe went to school at Campbelltown Academy and then the College of William and Mary, both in Virginia.  After graduating from William and Mary in 1776, Monroe fought in the Continental Army, serving with distinction at the Battle of Trenton, where he was shot in his left shoulder. He is depicted holding the flag in the famous painting of Washington Crossing the Delaware. Following his military service, he practiced law in Fredericksburg, Virginia. James Monroe married Elizabeth Kortright on February 16, 1786 at the Trinity Church in New York.",
    "millard fillmore":"Millard Fillmore (January 7, 1800   March 8, 1874) was the thirteenth President of the United States, serving from 1850 until 1853, and the last member of the Whig Party to hold that office. He was the second Vice President to assume the Presidency upon the death of a sitting President, succeeding Zachary Taylor who died of acute gastroenteritis. Fillmore was never elected President; after serving out Taylor's term, he failed to gain the nomination for the Presidency of the Whigs in the 1852 presidential election, and, four years later, in the 1856 presidential election, he again failed to win election as President as the Know Nothing Party and Whig candidate.Fillmore was born in a log cabin in Summerhill, New York, to Nathaniel and Phoebe Millard Fillmore, as the second of nine children and the eldest son.    Though a Unitarian in later life,Fillmore was descended from Scottish Presbyterians on his father's side and English dissenters on his mother's. He was first apprenticed to a fuller to learn the cloth-making trade. He also served as a home guard in the New York militia for some time. He struggled to obtain an education under frontier conditions, attending New Hope Academy for six months.",
    "abraham lincoln":"Ulysses S. Grant, See military career for a discussion of Grant's middle initial.  born Hiram Ulysses Grant (April 27, 1822   July 23, 1885), was an American general and the eighteenth President of the United States (1869 1877). He achieved international fame as the leading Union general in the American Civil War.Grant first reached national prominence by taking Forts Henry and Donelson in 1862 in the first Union victories of the war.  The following year, his brilliant campaign ending in the surrender of Vicksburg secured Union control of the Mississippi and—with the simultaneous Union victory at Gettysburg—turned the tide of the war in the North's favor. Named commanding general of the Federal armies in 1864, he implemented a coordinated strategy of simultaneous attacks aimed at destroying the South's ability to carry on the war.  In 1865, after conducting a costly war of attrition in the East, he accepted the surrender of his Confederate opponent Robert E. Lee at Appomattox Court House. Grant has been described by  J.F.C. Fuller as 'the greatest general of his age and one of the greatest strategists of any age.' His Vicksburg Campaign in particular has been scrutinized by military specialists around the world.",
    "ulysses S. grant":"Ulysses S. Grant, See military career for a discussion of Grant's middle initial.  born Hiram Ulysses Grant (April 27, 1822   July 23, 1885), was an American general and the eighteenth President of the United States (1869 1877). He achieved international fame as the leading Union general in the American Civil War.Grant first reached national prominence by taking Forts Henry and Donelson in 1862 in the first Union victories of the war.  The following year, his brilliant campaign ending in the surrender of Vicksburg secured Union control of the Mississippi and—with the simultaneous Union victory at Gettysburg—turned the tide of the war in the North's favor. Named commanding general of the Federal armies in 1864, he implemented a coordinated strategy of simultaneous attacks aimed at destroying the South's ability to carry on the war.  In 1865, after conducting a costly war of attrition in the East, he accepted the surrender of his Confederate opponent Robert E. Lee at Appomattox Court House. Grant has been described by  J.F.C. Fuller as 'the greatest general of his age and one of the greatest strategists of any age.' His Vicksburg Campaign in particular has been scrutinized by military specialists around the world.",
    "grover cleveland":"Stephen Grover Cleveland (March 18 1837   June 24 1908), the twenty-second and twenty-fourth President of the United States, was the only President to serve non-consecutive terms (1885 1889 and 1893 1897). He was defeated for reelection in 1888 by Benjamin Harrison, against whom he ran again in 1892 and won a second term. He was the only Democrat elected to the Presidency in the era of Republican political domination between 1860 and 1912, after the American Civil War. His admirers praise him for his bedrock honesty, independence, integrity, and commitment to the principles of classical liberalism. As a leader of the Bourbon Democrats, he opposed imperialism, taxes, corruption, patronage, subsidies and inflationary policies.Some of Cleveland's actions were controversial with political factions. Such criticisms include but are not limited to: his intervention in the Pullman Strike of 1894 in order to keep the railroads moving (a move which angered labor unions), his support of the gold standard, and opposition to free silver which alienated the agrarian wing of the Democrats.  Furthermore, critics complained that he had little imagination and seemed overwhelmed by the nation's economic disasters   depressions and strikes   in his second term. He lost control of his party to the agrarians and silverites in 1896.",
    "theodore roosevelt":"Theodore Roosevelt, Jr. ( ; October 27 1858   January 6 1919), also known as T.R., and to the public (but never to friends and intimates) as Teddy, was the twenty-sixth President of the United States, and a leader of the Republican Party and of the Progressive Movement.   He became the youngest President in United States history at the age of 42. He served in many roles including Governor of New York, historian, naturalist, explorer, author, and soldier. Roosevelt is most famous for his personality: his energy, his vast range of interests and achievements, his model of masculinity, and his 'cowboy' persona. His last name, often mispronounced, is, per Roosevelt, 'pronounced as if it were spelled 'Rosavelt', in three syllables, the first syllable as if it was 'Rose.'As Assistant Secretary of the U.S. Navy, he prepared for and advocated war with Spain in 1898. He organized and helped command the 1st U.S. Volunteer Cavalry Regiment, the Rough Riders, during the Spanish-American War. Returning to New York as a war hero, he was elected Republican governor in 1899. He was a professional historian, a lawyer, a naturalist and explorer of the Amazon Basin; his 35 books include works on outdoor life, natural history, the American frontier, political history, naval history, and his autobiography.",
    "woodrow wilson":"Thomas Woodrow Wilson (December 28, 1856–February 3, 1924), was the twenty-eighth President of the United States. A devout Presbyterian and leading 'intellectual' of the Progressive Era, he served as president of Princeton University then became the reform governor of New Jersey in 1910. With Theodore Roosevelt and William Howard Taft dividing the Republican vote, Wilson was elected President as a Democrat in 1912. He proved highly successful in leading a Democratic Congress to pass major legislation including the Federal Trade Commission, the Clayton Antitrust Act, the Underwood Tariff, the Federal Farm Loan Act and most notably the Federal Reserve System.Narrowly re-elected in 1916, his second term centered on World War I. He tried to maintain U.S. neutrality, but when Germany began unrestricted submarine warfare he wrote several admonishing notes to Germany. Subsequently he asked Congress to declare war on the Central Powers. He focused on diplomacy and financial considerations, leaving the waging of the war primarily in the hands of the military establishment. On the home front he began the first effective draft in 1917, raised billions through Liberty loans, imposed an income tax, set up the War Industries Board, promoted labor union growth, supervised agriculture and food production through the Lever Act, took over control of the railroads, and suppressed anti-war movements.  He paid surprisingly little attention to military affairs, but provided the funding and food supplies that helped the Americans in the war Allied victory in 1918 possible.",
    "calvin coolidge":"John Calvin Coolidge, Jr. (July 4 1872   January 5 1933), more commonly known as Calvin Coolidge, was the thirtieth President of the United States (1923–1929).  A lawyer from Vermont, Coolidge worked his way up the ladder of Massachusetts state politics, eventually becoming governor of that state. His actions during the Boston Police Strike of 1919 thrust him into the national spotlight. Soon after, he was elected as the twenty-ninth Vice President in 1920 and succeeded to the Presidency upon the death of Warren G. Harding. Elected in his own right in 1924, he gained a reputation as a small-government conservative.In many ways Coolidge's style of governance was a throwback to the passive presidency of the nineteenth century. Sobel, 14  He restored public confidence in the White House after the scandals of his predecessor's administration, and left office with considerable popularity. McCoy, 420–421; Greenberg, 49–53  As his biographer later put it, 'he embodied the spirit and hopes of the middle class, could interpret their longings and express their opinions. That he did represent the genius of the average is the most convincing proof of his strength.' Fuess, 500Many later criticized Coolidge as part of a general criticism of laissez-faire government. McCoy, 418; Greenberg, 146–150; Ferrell, 66–72  His reputation underwent a renaissance during the Reagan administration, Sobel, 12–13; Greenberg, 2–3  but the ultimate assessment of his presidency is still divided between those who approve of his reduction of the size of government and those who believe the federal government should be more involved in regulating the economy. Greenberg, 1–7",
    "gerald ford":"Gerald Rudolph Ford, Jr. (July 14, 1913   December 26, 2006) was the thirty-eighth President of the United States, serving from 1974 to 1977, and the fortieth Vice President of the United States serving from 1973 to 1974. He was the first person appointed to the vice presidency under the terms of the 25th Amendment, and became President upon Richard Nixon's resignation on August 9, 1974.Prior to 1973, Ford served for over eight years as the Republican Minority Leader of the United States House of Representatives; he was originally elected to Congress in 1948 from Michigan's 5th congressional district."
}