{
    "Liechtenstein":"The Principality of Liechtenstein (  ( , ( ) is a tiny, doubly landlocked alpine country in Western Europe, bordered by Switzerland to its west and by Austria to its east. Mountainous, it is a winter sports resort, although it is perhaps best known as a tax haven. Despite this, it is not heavily urbanized. Many cultivated fields and small farms characterize its landscape both in the north (Unterland) and in the south (Oberland). It is the smallest German-speaking country in the world. At one time, the territory of Liechtenstein formed a part of the ancient Roman province of Raetia. For centuries this territory, geographically removed from European strategic interests, had little impact on the tide of European history. Prior to the reign of its current dynasty, the region was enfeoffed to a line of the counts of Hohenems.The Liechtenstein dynasty, from which the principality takes its name (rather than vice-versa), comes from Castle Liechtenstein in faraway Lower Austria, which the family possessed from at least 1140 to the thirteenth century, and from 1807 onward. Through the centuries, the dynasty acquired vast swathes of land, predominantly in Moravia, Lower Austria, Silesia, and Styria, though in all cases, these territories were held in fief under other more senior feudal lords, particularly under various lines of the Habsburg family, to whom several Liechtenstein princes served as close advisors. Thus, and without any territory held directly under the Imperial throne, the Liechtenstein dynasty was unable to meet a primary requirement to qualify for a seat in the Imperial diet, the Reichstag. The family yearned greatly for the added power which a seat in the Imperial government would garner, and therefore, searched for lands to acquire which would be unmittelbar or held without any feudal personage other than the Holy Roman Emperor himself having rights on the land. After some time, the family was able to arrange the purchase of the minuscule Herrschaft ('Lordship') of Schellenberg and countship of Vaduz (in 1699 and 1712 respectively) from the Hohenems. Tiny Schellenberg and Vaduz possessed exactly the political status required, no feudal lord other than their comital sovereign and the suzerain Emperor.",
    "Indonesia":"The Indonesian archipelago has been an important trade region since at least the seventh century, when the Srivijaya Kingdom formed trade links with China. Indonesian history has been influenced by foreign powers drawn to its natural resources. Under Indian influence, Hindu and Buddhist kingdoms flourished from the early centuries CE. Muslim traders brought Islam, and European powers fought one another to monopolize trade in the Spice Islands of Maluku during the Age of Exploration. Following three and a half centuries of Dutch colonialism, Indonesia secured its independence after World War II. Indonesia's history has since been turbulent, with challenges posed by natural disasters, corruption, separatism, a democratization process, and periods of rapid economic change.Across its many islands, Indonesia consists of distinct ethnic, linguistic, and religious groups. The Javanese are the largest and politically dominant ethnic group. As a unitary state and a nation, Indonesia has developed a shared identity defined by a national language, a majority Muslim population, and a history of colonialism and rebellion against it. Indonesia's national motto, 'Bhinneka tunggal ika' ('Unity in Diversity' lit. 'many, yet one'), articulates the diversity that shapes the country. However, sectarian tensions and separatism have led to violent confrontations that have undermined political and economic stability. Despite its large population and densely populated regions, Indonesia has vast areas of wilderness that support the world's second highest level of biodiversity. The country is richly endowed with natural resources, yet poverty is a defining feature of contemporary Indonesia.The name Indonesia derives from the Latin Indus, meaning 'India', and the Greek nesos, meaning 'island'.The name dates to the 18th century, far predating the formation of independent Indonesia.In 1850, George Earl, an English ethnologist, proposed the terms Indunesians and, his preference, Malayunesians for the inhabitants of the 'Indian Archipelago or Malayan Archipelago'.    In the same publication, a student of Earl's, James Richardson Logan, used Indonesia as a synonym for Indian Archipelago.  ;    However, Dutch academics writing in East Indies publications were reluctant to use Indonesia. Instead, they used the terms Malay Archipelago (Maleische Archipel); the Netherlands East Indies (Nederlandsch Oost Indië), popularly Indië; the East (de Oost); and even Insulinde. (This term was introduced in 1860 in the influential novel Max Havelaar (1859), written by Multatuli, critical of Dutch colonialism).From 1900, the name Indonesia became more common in academic circles outside the Netherlands, and Indonesian nationalist groups adopted it for political expression.    Adolf Bastian, of the University of Berlin, popularized the name through his book Indonesien oder die Inseln des Malayichen Archipels, 1884–1894. The first Indonesian scholar to use the name was Suwardi Suryaningrat (Ki Hajar Dewantara), when he established a press bureau in the Netherlands with the name Indonesisch Pers-bureau in 1913.",
    "Singapore":"The first records of settlement in Singapore are from the second century AD.    The island was an outpost of the Sumatran Srivijaya empire and originally bore the Javanese name Temasek ('sea town'). Temasek (Tumasek) rapidly became a significant trading settlement, but declined in the late 14th century. There are few remnants of old Temasek in Singapore, but archaeologists in Singapore have uncovered artefacts of that and other settlements. Between the 16th and early 19th centuries, Singapore island was part of the Sultanate of Johor. During the Malay-Portugal wars in 1613, the settlement was set ablaze by Portuguese troops.    The Portuguese subsequently held control in that century and the Dutch in the 17th, but throughout most of this time the island's population consisted mainly of fishermen.On January 29 1819, Sir Thomas Stamford Raffles landed on the main island. Spotting its potential as a strategic geographical trading post in Southeast Asia, Raffles signed a treaty with Sultan Hussein Shah on behalf of the British East India Company to develop Singapore as a British trading post and settlement, marking the start of the island's modern era. Raffles's deputy, William Farquhar, oversaw a period of growth and ethnic migration, which was largely spurred by a no-restriction immigration policy. The British India office governed the island from 1858, but Singapore was made a British crown colony in 1867, answerable directly to the Crown. By 1869 the island boasted a sizeable community of 100,000.The early onset of town planning in colonial Singapore came largely through a 'divide and rule' framework where the different ethnic groups were settled in different parts of the South of the island. The Singapore River was largely a commercial area that was dominated by traders and bankers of various ethnic groups with mostly Chinese and Indian coolies working to load and unload goods from barge boats known locally as 'bumboats'. The Malays, consisting of the local 'Orang Lauts' who worked mostly as fishermen and sea-farers, and Arab traders and scholars were mostly found in the South-east part of the river mouth, where Kampong Glam stands today. The European settlers, who were few then, settled around Fort Canning Hill and further upstream from the Singapore River. Like the Europeans, the early Indian migrants also settled more inland of the Singapore River, where Little India stands today. Very little is known about the rural private settlements in those times (known as kampongs), other than the major move by the post-independent Singapore government to re-settle these residents in the late 1960s.Statue of Thomas Stamford Raffles by Thomas Woolner, erected at the location where he first landed at Singapore. He is recognized as the founder of modern Singapore.",
    "Qatar":"The name 'Qatar' may derive from the same Arabic root as qatura which means 'to exude.'  The word Qatura traces to the Arabic qatran meaning 'tar' or 'resin', which relates to the country's rich resources in petroleum and natural gas.  Adrian Room, Placenames of the World (1997) McFarland and Company.Other sources say the name may derive from 'Qatara', believed to refer to the Qatari town of Zubara, an important trading port and town in the region in ancient times. The word 'Qatara' first appeared on Ptolemy's map of the Arabian Peninsula. An approximation of the native pronunciation falls between the English words 'cutter' and 'gutter', but not like 'guitar'.",
    "Finland":"Finland, officially the Republic of Finland 'Republic of Finland', or 'Suomen tasavalta' in Finnish and 'Republiken Finland' in Swedish, is the long protocol name, which is not defined by the law. Legislation only recognizes the short name.  ( ), is a Nordic country situated in Northern Europe. It has borders with Sweden to the west, Russia to the east, and Norway to the north, while Estonia lies to its south across the Gulf of Finland. The capital city is Helsinki.Finland has a population of 5,300,362 people,  spread over an area of  . The majority of the population is concentrated in the southern part of the country. Finland is the sixth largest country in Europe in terms of area, with a low population density of 15.5 people per square kilometre, making it the most sparsely populated country in the European Union.  As their mother tongue, most Finns speak Finnish, one of the few official languages of the European Union that is not of Indo-European origin. The second official language, Swedish, is spoken natively by a 5.5 percent minority.Previously part of Sweden and from 1809 an autonomous Grand Duchy within the Russian Empire, Finland declared its independence in 1917. Today, Finland is a democratic, parliamentary republic and has been a member state of the United Nations since 1955 and the European Union since 1995. Finland has thriving services and manufacturing sectors and is a highly democratic welfare state with low levels of corruption, consistently ranking at or near the top in international comparisons of national performance.Finland is eleventh on the United Nations' Human Development Index    and ranked as the sixth happiest nation in the world.    According to the World Audit Democracy profile, Finland is the freest nation in the world in terms of civil liberties, freedom of the press, low corruption levels and political rights.    Finland is rated the sixth most peaceful country in the world by the Economist Intelligence Unit,    and since 1945, Finland has been at peace, adopting neutrality in wartime.",
    "Ghana":"The Republic of Ghana is a country in West Africa. It borders Côte d'Ivoire (also known as Ivory Coast) to the west, Burkina Faso to the north, Togo to the east, and the Gulf of Guinea to the south. The word 'Ghana' means 'Warrior King', Jackson, John G. Introduction to African Civilizations, 2001. Page 201.  and was the source of the name 'Guinea' (via French Guinoye) used to refer to the West African coast (as in Gulf of Guinea).Ghana was inhabited in pre-colonial times by a number of ancient kingdoms, including the Ga Adangbes on the eastern coast, inland Empire of Ashanti and various Fante states along the coast and inland. Trade with European states flourished after contact with the Portuguese in the 15th century, and the British established a crown colony, Gold Coast, in 1874. MacLean, Iain. Rational Choice and British Politics: An Analysis of Rhetoric and Manipulation from Peel to Blair, 2001. Page 76.Upon achieving independence from the United Kingdom in 1957, Peter N. Stearns and William Leonard Langer. The Encyclopedia of World History: Ancient, Medieval, and Modern, Chronologically Arranged, 2001. Page 1050.  the name Ghana was chosen for the new nation to reflect the ancient Empire of Ghana that once extended throughout much of western Africa.",
    "Egypt":"Egypt (Egyptian: Kemet; Coptic:   Kīmi;     ; Egyptian Arabic:  ), officially the Arab Republic of Egypt, is a country in North Africa that includes the Sinai Peninsula, a land bridge to Asia. Covering an area of about  , Egypt borders Libya to the west, Sudan to the south, and the Gaza Strip and Israel to the east. The northern coast borders the Mediterranean Sea and the island of Cyprus; the eastern coast borders the Red Sea.Egypt is one of the most populous countries in Africa. The great majority of its estimated 78 million people (2007) live near the banks of the Nile River in an area of about   where the only arable agricultural land is found. The large areas of the Sahara Desert are sparsely inhabited. About half of Egypt's residents live in urban areas, with the majority spread across the densely populated centers of greater Cairo, Alexandria and other major cities in the Nile Delta.Egypt is famous for its ancient civilization and some of the world's most famous monuments, including the Giza pyramid complex and the Great Sphinx.  The southern city of Luxor contains numerous ancient artifacts, such as the Karnak Temple and the Valley of the Kings. Egypt is widely regarded as an important political and cultural nation of the Middle East.",
    "Romania":"Romania is a country in Southeastern Europe. It shares a border with Hungary and Serbia to the west, Ukraine and the Republic of Moldova to the northeast, and Bulgaria to the south. Romania has a stretch of sea coast along the Black Sea. It is located roughly in the lower basin of the Danube and almost all of the Danube Delta is located within its territory.Romania is a semi-presidential unitary state. As a nation-state, the country was formed by the merging of Moldavia and Wallachia in 1859 and it gained recognition of its independence in 1878. Later, in 1918, they were joined by Transylvania, Bukovina and Bessarabia. At the end of World War II, parts of its territories (roughly the present day Moldova) were occupied by USSR and Romania became a member of Warsaw Pact. With the fall of the Iron Curtain in 1989, Romania started a series of political and economic reforms that peaked with Romania joining the European Union.Romania has been a member of the European Union since January 1 2007, and has the ninth largest territory in the EU and with 22 million people      it has the 7th largest population among the EU member states. Its capital and largest city is Bucharest (   ), the sixth largest city in the EU with almost 2.5 million people. In 2007, Sibiu, a large city in Transylvania, was chosen as European Capital of Culture.    Romania joined NATO on March 29, 2004, and is also a member of the Latin Union, of the Francophonie and of OSCE."
}